Revit 2026 API

# SymbolicCurveArray Class

---

An array that contains model curves.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBSymbolicCurveArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SymbolicCurveArray : APIObject,
	IEnumerable
```
```vb
Public Class SymbolicCurveArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class SymbolicCurveArray : public APIObject,
	IEnumerable
```
```fsharp
type SymbolicCurveArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The SymbolicCurveArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SymbolicCurveArray | Initializes a new instance of the SymbolicCurveArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Item | Gets or sets a model curve at a specified index within the array. |
|  | Size | Returns the number of model curves that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append | Add the model curve to the end of the array. |
|  | Clear | Removes every model curve from the array, rendering it empty. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Insert | Insert the specified model curve into the array. |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace